package day01;

public class PrintTest {
	public static void main(String[] args) {
		// 주석
		// 1. 소스코드에 설명글을 달 때
		// 2. 지금 당장 사용하지 않는 코드를 번역하고 싶지 않을 때
		
		// 주석의 종류
		/*
		 *  1. 한줄주석 : Ctrl + /
		 *  2. 범위주석 : Ctrl + Shift + /, Ctrl + Shift + \
		 */
		
		//이름을 출력하는 부분
		//출력함수
		System.out.print("진세종");
		
		//나이를 출력하는 부분
		System.out.print("20살");
		
		/*Java = 프로그래밍 언어
		*프로그래밍 언어는 개발자와 운영체제가 소통하기 위한 언어이다
		*프로그램 = 소스코드로 잘 짜여진 틀
		*
		*JAVA프로그램
		*JVM : JVAA프로그램을 OS에 맞게 번역 <= JAVA가 이식성이 좋은 이유
		*OS(운영체제) - 하드웨어에 적절한 전기신호를 흘려주는 역할
		*하드웨어
		*
		*소드코드 : 명령어를 작성해 놓은 것
		*			  운영체제와 개발자가 소통한 것을 글로 작성해 놓은것
		*
		*콘솔 : 사용자와 운영체제가 소통한 결과를 나타내는 창
		*
		*컴파일 : 사람의 언어를 컴퓨터 언어로 바꿔주는 작업
		*
		*컴파일러 : 컴파일 해주는 프로그램 또는 명령어
		*			(컴파일러 방향은 위에서 아래로, 좌에서 우로)
		*JVM(Java Virtual Machine) : JAVA프로그램을 실행해 줌
		*
		*JRE(Java Runtime Environment)
		*				JVM을 생성하는 부분
		*				JVM을 실행할 때 필요한 라이브러리 파일들을 가짐
		*
		*JDK(Java Development Kit)
		*				JRE 외에 개발에 필요한 도국들을 가지고 있다
		*				컴파일 명령어와 실행 명령어를 담고 있다.
		*
		*기본 구조
		*		프로젝트
		*			패키지
		*				클래스(앞 글자가 대문자)
		*					메소드(이름뒤에 소괄호)
		*						소스코드
		*ex) 프로젝트 day01 -> 패키지 day01 -> 클래스 PrintTest -> 메소드
		*
		*
		*
		*/
	}
}
